class ListTemplate {
  constructor (name , description, id = null) {
    this.id = id
    this.name = name
    this.description = description
  }
}

export default {
  state: {
    pointTemplates : [
      {
        'id': 21679,
        'parentId': 1112,
        'name': '9',
        'description': 'Работодателем обеспечено наличие санитарно-бытовых помещений.',
        'fine': 1000,
        'act': 'Пункт 3.6.1. Межотраслевых правил по охране труда на автомобильном транспорте ПОТ РМ-027-2003'
      },
      {
        'id': 21680,
        'parentId': 1112,
        'name': '9.1',
        'description': 'Работодателем организовано обеспечение работников, осуществляющих работы по эксплуатации грузовых автомобилей, питьевой водой. ',
        'fine': 1000,
        'act': 'Пункт 3.6.25. Межотраслевых правил по охране труда на автомобильном транспорте ПОТ РМ-027-2003'
      },
      {
        'id': 21681,
        'parentId': 1112,
        'name': '1',
        'description': 'К выполнению земляных работ работодателем допущены работники, занятые на работах с вредными и (или) опасными условиями труда, прошедшие обязательные предварительный (при поступлении на работу) и периодические (в течение трудовой деятельности) медицинские осмотры.',
        'fine': 1000,
        'act': 'Пункт 29 Правил по охране труда в строительстве, утвержденных приказом Министерства труда и социальной защиты Российской Федерации от 01.06.2015 г. № 336н (Зарегистрировано в Минюсте России 13 августа 2015 г. Регистрационный № 38511, Текст приказа опубликован на \'Официальном интернет-портале правовой информации\' (www.pravo.gov.ru) 17 августа 2015 г.) (далее - Правила по охране труда в строительстве)'
      },
      {
        'id': 21682,
        'parentId': 1112,
        'name': '2',
        'description': 'К выполнению земляных работ работодателем допущены работники, прошедшие подготовку по охране труда и стажировку на рабочем месте под руководством лиц, назначаемых работодателем.',
        'fine': 1000,
        'act': 'Пункт 30 Правил по охране труда в строительстве'
      },
      {
        'id': 21683,
        'parentId': 1179,
        'name': '2.1',
        'description': 'Работодателем утвержден Перечень работ, профессий и должностей работников, выполняющих земляные работы в условиях действия опасных производственных факторов, связанных с условиями и характером работы, к которым предъявляются дополнительные (повышенные) требования охраны труда, в отношении которых проводится специальное обучение по охране труда, а также порядок, форма, периодичность и продолжительность специального обучения. ',
        'fine': 1000,
        'act': 'Пункт 31 Правил по охране труда в строительстве'
      },
      {
        'id': 21684,
        'parentId': 1179,
        'name': '3',
        'description': 'Работники, выполняющие земляные работы, обеспечены средствами индивидуальной защиты, специальной одеждой и специальной обувью.',
        'fine': 1000,
        'act': 'Пункт 35 Правил по охране труда в строительстве'
      },
      {
        'id': 21685,
        'parentId': 1179,
        'name': '4',
        'description': 'Режим труда и отдыха работников, выполняющих земляные работы, установлен Правилами трудового распорядка с учетом особенностей производства, в которые, в том числе, входит:',
        'fine': 1000,
        'act': 'Пункт 38 Правил по охране труда в строительстве'
      },
      {
        'id': 21686,
        'parentId': 1179,
        'name': '4.1',
        'description': 'установление работникам, выполняющим земляные работы в холодное время года на открытом воздухе или в закрытых необогреваемых помещениях, специальных перерывов для обогревания и отдыха, которые включаются в рабочее время.',
        'fine': 1000,
        'act': 'Пункт 39 Правил по охране труда в строительстве'
      },
      {
        'id': 21687,
        'parentId': 1179,
        'name': '5',
        'description': 'Работодателем организовано санитарно-бытовое обеспечение работников, выполняющих земляные работы.',
        'fine': 1000,
        'act': 'Пункт 40 Правил по охране труда в строительстве'
      },
      {
        'id': 21688,
        'parentId': 1179,
        'name': '6',
        'description': 'Организация и проведение строительного производства осуществляются работодателем в соответствии с проектами организации строительства и проектами производства работ.',
        'fine': 1000,
        'act': 'Пункт 8 Правил по охране труда в строительстве'
      },
      {
        'id': 21689,
        'parentId': 1179,
        'name': '7',
        'description': 'Работодателем обеспечено проведение в соответствии с нарядом-допуском: работ, связанных с повышенной опасностью (земляных работ на участках с патогенным заражением почвы (свалки, скотомогильники и другие), в охранных зонах подземных электрических сетей, газопровода и других опасных подземных коммуникаций; работ на участках, где имеется или может возникнуть опасность, связанная с выполнением опасных работ на смежных участках; работ в непосредственной близости от полотна или проезжей части эксплуатируемых автомобильных и железных дорог), производимых в местах действия вредных и опасных производственных факторов в местах действия вредных и опасных производственных факторов, определяющим содержание, место, время и условия производства работ, необходимые меры безопасности, состав бригады и лиц, ответственных за безопасность работ; производство земляных работ в охранной зоне кабелей высокого напряжения, действующего газопровода, других коммуникаций, а также на участках с возможным патогенным заражением почвы (свалки, скотомогильники, кладбища и тому подобное).',
        'fine': 1000,
        'act': 'Пункты 20, 150 Правил по охране труда в строительстве'
      },
      {
        'id': 21690,
        'parentId': 1179,
        'name': '8',
        'description': 'Работодателем организована разработка инструкций по охране труда по профессиям и видам выполняемых работ, которые утверждены локальными нормативными актами работодателя.',
        'fine': 1000,
        'act': 'Пункт 3 Правил по охране труда в строительстве'
      },
      {
        'id': 21691,
        'parentId': 1179,
        'name': '9',
        'description': 'На границах зон с постоянным присутствием опасных производственных факторов работодателем обеспечена  установка защитных ограждений.',
        'fine': 1000,
        'act': 'Пункт 12 Правил по охране труда в строительстве'
      },
      {
        'id': 21692,
        'parentId': 1179,
        'name': '10',
        'description': 'У работодателя имеется в наличии акт-допуск для производства строительно-монтажных работ на территории действующего производственного объекта, оформленный перед началом строительного производства на территории действующего производственного объекта работодателем и руководителем хозяйствующего субъекта, эксплуатирующими производственный объект.',
        'fine': 1000,
        'act': 'Пункт 16 Правил по охране труда в строительстве'
      },
      {
        'id': 21693,
        'parentId': 1179,
        'name': '11',
        'description': 'На объектах проведения строительного производства работодателем организованы посты оказания первой помощи, обеспеченные аптечками для оказания первой помощи работникам, укомплектованными изделиями медицинского назначения.',
        'fine': 1000,
        'act': 'Пункт 44 Правил по охране труда в строительстве'
      },
      {
        'id': 21694,
        'parentId': 1180,
        'name': '1',
        'description': 'Удержания из заработной платы работника производятся только в случаях, предусмотренных Трудовым кодексом Российской Федерации: \n- для возмещения неотработанного аванса, выданного работнику в счет заработной платы;\n- для погашения неизрасходованного и своевременно не возвращенного аванса, выданного в связи со служебной командировкой или переводом на другую работу в другую местность, а также в других случаях;\n- для возврата сумм, излишне выплаченных работнику вследствие счетных ошибок, а также сумм, излишне выплаченных работнику, в случае признания органом по рассмотрению индивидуальных трудовых споров вины работника в невыполнении норм труда или простое;\n- при увольнении работника до окончания того рабочего года, в счет которого он уже получил ежегодный оплачиваемый отпуск, за неотработанные дни отпуска (за исключением случаев увольнения работника по основаниям, предусмотренным пунктом 8 части первой статьи 77 или пунктами 1, 2 или 4 части первой статьи 81, пунктах 1, 2, 5, 6 и 7 статьи 83 Трудового кодекса Российской Федерации)\n',
        'fine': 1000,
        'act': 'Часть 2 статьи 137 Трудового кодекса Российской Федерации (Собрание законодательства Российской Федерации, 2002, № 1, ст. 3; 2006, № 27, ст. 2878)'
      },
      {
        'id': 21695,
        'parentId': 1180,
        'name': '2',
        'description': 'Работодатель произвел удержания из заработной платы работника не позднее одного месяца со дня окончания срока, установленного для возвращения аванса, погашения задолженности или неправильно исчисленных выплат, и при условии, если работник не оспаривает оснований и размеров удержания\n ',
        'fine': 1000,
        'act': 'Часть 3 статьи 137 Трудового кодекса Российской Федерации (Собрание законодательства Российской Федерации, 2002, № 1, ст. 3)'
      },
      {
        'id': 21696,
        'parentId': 1180,
        'name': '3',
        'description': 'Работодатель соблюдает общий размер удержаний по заработной плате  ',
        'fine': 1000,
        'act': 'Части 1 - 3 статьи 138 Трудового кодекса Российской Федерации (Собрание законодательства Российской Федерации, 2002, № 1, ст. 3; 2006, № 27, ст. 2878)'
      },
      {
        'id': 21732,
        'parentId': 1183,
        'name': '11',
        'description': 'Для работы в электроустановках наряд-допуск составлен по форме, установленной Правилами по охране труда при эксплуатации электроустановок.\n',
        'fine': 1000,
        'act': 'Пункт 42 Правил'
      },
      {
        'id': 21733,
        'parentId': 1183,
        'name': '12',
        'description': 'Выполнение монтажных работ в действующих производственных помещениях с повышенной взрывоопасностью и газоопасностью осуществляется по наряду-допуску.\n',
        'fine': 1000,
        'act': 'Абзац первый пункта 74 Правил'
      },
      {
        'id': 21734,
        'parentId': 1183,
        'name': '13',
        'description': 'Режимы труда и отдыха работников установлен правилами внутреннего трудового распорядка и иными локальными нормативными актами работодателя в соответствии с трудовым законодательством.',
        'fine': 1000,
        'act': 'Пункт 14 Правил'
      },
      {
        'id': 21735,
        'parentId': 1183,
        'name': '14',
        'description': 'На рабочем месте руководителя работ размещен список всех помещений с наличием вредных веществ и газоопасных мест, утверждаемый работодателем.\n',
        'fine': 1000,
        'act': 'Пункт 27 Правил'
      },
      {
        'id': 21748,
        'parentId': 1184,
        'name': '2',
        'description': 'К выполнению работ по эксплуатации грузоподъемных машин и механизмов работодателем допущены работники, прошедшие соответствующее обучение.',
        'fine': 1000,
        'act': 'Пункт 10.5. Межотраслевых правил по охране труда на автомобильном транспорте ПОТ РМ-027-2003'
      },
      {
        'id': 21736,
        'parentId': 1183,
        'name': '15',
        'description': 'Учет тепловых энергоустановок осуществляется работодателем в журнале учета тепловых энергоустановок, в котором отражены сведения:\n1) порядковый номер записи;\n2) дата постановки тепловой энергоустановки на учет;\n3) наименование тепловой энергоустановки;\n4) характеристики тепловой энергоустановки:\nпараметры работы (давление, температура);\nпроизводительность (Гкал/час, т/час);\nпропускная способность (т/час);\nтеплопотребление (Гкал/час, час);\n5) место расположения тепловой энергоустановки;\n6) должность, фамилия и инициалы лица, ответственного за исправное состояние и безопасную эксплуатацию тепловых энергоустановок.\n',
        'fine': 1000,
        'act': 'Пункт 35 Правил'
      },
      {
        'id': 21781,
        'parentId': 1185,
        'name': '20',
        'description': 'В организации имеется Перечень профессий и работ, к которым предъявляются дополнительные требования по безопасности труда, а также Перечень работ повышенной опасности, на проведение которых оформляется наряд-допуск.',
        'fine': 1000,
        'act': 'Пункт 1.14 ПОТ Р М 006-97'
      },
      {
        'id': 21782,
        'parentId': 1185,
        'name': '21',
        'description': 'У работодателя имеется локальный нормативный акт, устанавливающий Порядок производства работ повышенной опасности, оформления наряда-допуска и обязанности должностных лиц, ответственных за организацию и безопасное производство работ.',
        'fine': 1000,
        'act': 'Абзац третий пункта 28 Правил'
      },
      {
        'id': 21783,
        'parentId': 1185,
        'name': '22',
        'description': 'Оформленные и выданные наряды-допуски регистрируются в журнале.',
        'fine': 1000,
        'act': 'Пункт 31 Правил'
      },
      {
        'id': 21784,
        'parentId': 1185,
        'name': '23',
        'description': 'Работники цехов и участков холодной обработки металлов обеспечены средствами индивидуальной защиты.',
        'fine': 1000,
        'act': 'Пункт 10.1 ПОТ Р М 006-97'
      },
      {
        'id': 21785,
        'parentId': 1185,
        'name': '24',
        'description': 'Вновь поступившие на работу ознакомлены с применяемыми средствами защиты от воздействия опасных и вредных производственных факторов.\n\n',
        'fine': 1000,
        'act': 'Пункт 10.2 ПОТ Р М 006-97'
      },
      {
        'id': 21786,
        'parentId': 1185,
        'name': '25',
        'description': 'На все применяемые средства защиты имеется утвержденная  техническая документация.',
        'fine': 1000,
        'act': 'Пункт 10.3  ПОТ РО-14000-003-98 '
      },
      {
        'id': 21787,
        'parentId': 1185,
        'name': '26',
        'description': 'В помещениях, где хранятся химические вещества и растворы  вывешены инструкции по безопасному обращению с ними.',
        'fine': 1000,
        'act': 'Пункт 5.51 ПОТ РО-14000-003-98'
      },
      {
        'id': 21788,
        'parentId': 1185,
        'name': '27',
        'description': 'Помещения цехов (участков) для холодной обработки металлов оборудованы общеобменной приточно-вытяжной вентиляцией. В зимнее время приточный воздух подогревается.',
        'fine': 1000,
        'act': 'Пункт 2.2.9 ПОТ Р М 006-97 '
      },
      {
        'id': 21789,
        'parentId': 1185,
        'name': '28',
        'description': 'В сварочных цехах и на участках оборудована общеобменная вентиляция, а на стационарных рабочих местах - местная вентиляция.\n\n\n',
        'fine': 1000,
        'act': 'Пункт 16 Правил\n'
      },
      {
        'id': 21790,
        'parentId': 1185,
        'name': '29',
        'description': 'Для сварки, наплавки и резки металлов с выделением бериллия и его сплавов выделено изолированное помещение, которое  оборудовано вытяжной вентиляцией.',
        'fine': 1000,
        'act': 'Пункт 17 Правил\n'
      },
      {
        'id': 21791,
        'parentId': 1185,
        'name': '30',
        'description': 'Ручная дуговая сварка производится на стационарных постах, оборудованных вытяжной вентиляцией. \n\n',
        'fine': 1000,
        'act': 'Пункт 65 Правил\n'
      },
      {
        'id': 21792,
        'parentId': 1185,
        'name': '31',
        'description': 'В помещениях, в которых проводятся газопламенные работы, предусмотрена вентиляция для удаления выделяющихся вредных газов.',
        'fine': 1000,
        'act': 'Пункт 89 Правил \n'
      },
      {
        'id': 21793,
        'parentId': 1185,
        'name': '32',
        'description': 'При выполнении сварки под флюсом на стационарных постах сварочные установки оснащены местными отсосами.\n',
        'fine': 1000,
        'act': 'Пункт 76 Правил \n'
      },
      {
        'id': 21794,
        'parentId': 1185,
        'name': '33',
        'description': 'Рабочие места сварщиков при выполнении сварки под флюсом труб и других крупногабаритных конструкций оборудованы специальными кабинами с подачей приточного воздуха, тепло- и звукоизоляцией наружных поверхностей и пультом управления сварочным процессом.',
        'fine': 1000,
        'act': 'Пункт 80 Правил \n'
      },
      {
        'id': 21795,
        'parentId': 1185,
        'name': '34',
        'description': 'В местах возможного скопления газа в производственных помещениях установлены газоанализаторы, извещающие об утечках газа звуковыми и световыми сигналами.',
        'fine': 1000,
        'act': 'Пункт 3.21 ПОТ РО-14000-003-98'
      },
      {
        'id': 21796,
        'parentId': 1185,
        'name': '35',
        'description': 'Рабочие места сварщиков ограждены экранами или ширмами из негорючих материалов высотой не менее 1,6 м.',
        'fine': 1000,
        'act': 'Пункт 7.17 ПОТ РО-14000-003-98'
      },
      {
        'id': 21797,
        'parentId': 1185,
        'name': '36',
        'description': ' Места проведения погрузочно-разгрузочных работ оборудованы знаками безопасности.',
        'fine': 1000,
        'act': 'Пункт 5.30 ПОТ Р М 006-97'
      }
    ]
  },
  mutations: {},
  actions: {},
  getters: {
    pointTemplatesByParentId (state, parentId) {
      return state.pointTemplates.filter( pointTemplate => {return pointTemplate.parentId === parentId})
    }
  }
}
